#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.network.aws_eip.public_eip: Refreshing state... [id=eipalloc-03cc7b21f9d50b165]
module.policy.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_exec]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=nvs11fvmla]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.vpc.aws_vpc.kpinetworks_vpc: Refreshing state... [id=vpc-027821fac01f33b20]
module.policy.aws_iam_policy.lambda_network: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=helloWorldHandler.zip]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function]
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/minimal_lambda_function]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/rds_migrations]
module.policy.aws_iam_role.codebuild_role: Refreshing state... [id=codebuild_exec_role]
module.buckets.aws_s3_bucket_object.db_sample_function_object: Refreshing state... [id=dbSampleHandler.zip]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=32ye4t]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-nvs11fvmla-32ye4t-GET]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=minimal_lambda_function]
module.policy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=lambda_exec-20210927225016507100000001]
module.policy.aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=lambda_exec-20210928115941399100000001]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_iam_role_policy.codebuild_role_policy: Refreshing state... [id=codebuild_exec_role:terraform-20210928104330645100000001]
module.vpc.aws_subnet.private_subnet_a: Refreshing state... [id=subnet-0e9f879fe6565c455]
module.vpc.aws_subnet.public_subnet_a: Refreshing state... [id=subnet-05ac82d4b6214f157]
module.network.aws_internet_gateway.igw_kpinetworks: Refreshing state... [id=igw-0365a893d3d414bac]
module.vpc.aws_security_group.kpinetworks_group_codebuild: Refreshing state... [id=sg-01c01a8ca3651b664]
module.vpc.aws_subnet.private_subnet_b: Refreshing state... [id=subnet-0e21f08e0f80d630c]
module.vpc.aws_security_group.kpinetworks_group_lambda: Refreshing state... [id=sg-030a494008864a4ba]
module.vpc.aws_security_group.kpinetworks_group: Refreshing state... [id=sg-07aff3becbbd8b55e]
module.network.aws_route_table.kpinetworks_rt_public: Refreshing state... [id=rtb-0a639f7f427b6ebf0]
module.sql.aws_db_subnet_group.kpinetworks: Refreshing state... [id=kpinetworks]
module.functions.aws_lambda_function.db_sample_lambda_function: Refreshing state... [id=db_sample_lambda_function]
module.network.aws_nat_gateway.nat_kpinetworks: Refreshing state... [id=nat-0da10a4d974eaa110]
module.network.aws_route_table.kpinetworks_rt_private: Refreshing state... [id=rtb-0615d62a0e3c17023]
module.network.aws_route_table_association.public_a_subnet: Refreshing state... [id=rtbassoc-077dc26b0b20d2772]
module.sql.aws_db_instance.kpinetworks_db: Refreshing state... [id=kpinetworksdb]
module.network.aws_route_table_association.private_a_subnet: Refreshing state... [id=rtbassoc-0c7cc987ef85f1964]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-nvs11fvmla-32ye4t-GET]
module.network.aws_api_gateway_deployment.example: Refreshing state... [id=r6obbp]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/rds_migrations]
module.network.aws_api_gateway_stage.example: Refreshing state... [id=ags-nvs11fvmla-prod]
module.codebuild.aws_codebuild_webhook.rds_migrations: Refreshing state... [id=rds_migrations]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.functions.aws_lambda_function.db_sample_lambda_function has been changed
  ~ resource "aws_lambda_function" "db_sample_lambda_function" {
        id                             = "db_sample_lambda_function"
      + layers                         = []
      + tags                           = {}
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.network.aws_route_table.kpinetworks_rt_private has been changed
  ~ resource "aws_route_table" "kpinetworks_rt_private" {
        id               = "rtb-0615d62a0e3c17023"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0da10a4d974eaa110"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "nat-0da10a4d974eaa110"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ]
        tags             = {}
        # (5 unchanged attributes hidden)
    }
  # module.buckets.aws_s3_bucket_object.db_sample_function_object has been changed
  ~ resource "aws_s3_bucket_object" "db_sample_function_object" {
        id                 = "dbSampleHandler.zip"
      + metadata           = {}
      + tags               = {}
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets.data.aws_s3_bucket_object.db_sample_function_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "db_sample_function_zip"  {
      + body                          = (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      ~ content_length                = 585 -> (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "b5bb846fd00e74a844d073e88e8c577d" -> (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      ~ id                            = "kpinetwork-backend/dbSampleHandler.zip" -> (known after apply)
      ~ last_modified                 = "Tue, 28 Sep 2021 12:03:02 UTC" -> (known after apply)
      ~ metadata                      = {} -> (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {} -> (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.buckets.data.aws_s3_bucket_object.minimal_function_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "minimal_function_zip"  {
      + body                          = (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      ~ content_length                = 620 -> (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "b332a27b6396f5e9d905641bce198f80" -> (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      ~ id                            = "kpinetwork-backend/helloWorldHandler.zip" -> (known after apply)
      ~ last_modified                 = "Tue, 28 Sep 2021 10:43:29 UTC" -> (known after apply)
      ~ metadata                      = {} -> (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {} -> (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.db_sample_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "db_sample_function_object" {
      ~ etag               = "b5bb846fd00e74a844d073e88e8c577d" -> "aa43c747a13b1dd11b609e353b7c3366"
        id                 = "dbSampleHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "b332a27b6396f5e9d905641bce198f80" -> "e8bbf4e545f9b51739242714d0de9b03"
        id                 = "helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.db_sample_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "db_sample_lambda_function" {
        id                             = "db_sample_lambda_function"
      ~ last_modified                  = "2021-09-28T12:03:06.430+0000" -> (known after apply)
      ~ source_code_hash               = "BG78uuHJvIGRDP7oBOJ4e3ubrT29/RItadxI1qULxDE=" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "minimal_lambda_function"
      ~ last_modified                  = "2021-09-28T12:03:02.027+0000" -> (known after apply)
      ~ source_code_hash               = "mPVwhMYiX3QQz/olIU+ceGQSrSfNmqpUjSsjhXsUo8M=" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.aws_route_table.kpinetworks_rt_private will be updated in-place
  ~ resource "aws_route_table" "kpinetworks_rt_private" {
        id               = "rtb-0615d62a0e3c17023"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0da10a4d974eaa110"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0da10a4d974eaa110"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {}
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*